Revit 2027 API
Category.GetBuiltInCategory Method
 Gets the BuiltInCategory value corresponding to the given built-in category identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId categoryTypeId
)
Public Shared Function GetBuiltInCategory (
	categoryTypeId As ForgeTypeId
) As BuiltInCategory
public:
static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId^ categoryTypeId
)
static member GetBuiltInCategory :
        categoryTypeId : ForgeTypeId -> BuiltInCategory
Parameters
categoryTypeId ForgeTypeId
 The built-in category identifier.
Return Value
BuiltInCategory
 The BuiltInCategory value corresponding to the given built-in category identifier.
Exceptions
Exception | Condition
ArgumentException |  categoryTypeId is not a built-in category identifier. See Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
ArgumentNullException |  A non-optional argument was null
Remarks
 A ForgeTypeId identifies a built-in category if it corresponds to a valid BuiltInCategory value according to Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace